__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            (None, 320, 64, 1)   0
__________________________________________________________________________________________________
conv64-s (Conv2D)               (None, 160, 32, 64)  1664        input_1[0][0]
__________________________________________________________________________________________________
conv64-s_bn (BatchNormalization (None, 160, 32, 64)  256         conv64-s[0][0]
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 160, 32, 64)  0           conv64-s_bn[0][0]
__________________________________________________________________________________________________
res1_0_branch_2a (Conv2D)       (None, 160, 32, 64)  36928       lambda_1[0][0]
__________________________________________________________________________________________________
res1_0_branch_2a_bn (BatchNorma (None, 160, 32, 64)  256         res1_0_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 160, 32, 64)  0           res1_0_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res1_0_branch_2b (Conv2D)       (None, 160, 32, 64)  36928       lambda_2[0][0]
__________________________________________________________________________________________________
res1_0_branch_2b_bn (BatchNorma (None, 160, 32, 64)  256         res1_0_branch_2b[0][0]
__________________________________________________________________________________________________
add_1 (Add)                     (None, 160, 32, 64)  0           res1_0_branch_2b_bn[0][0]
                                                                 lambda_1[0][0]
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 160, 32, 64)  0           add_1[0][0]
__________________________________________________________________________________________________
res1_1_branch_2a (Conv2D)       (None, 160, 32, 64)  36928       lambda_3[0][0]
__________________________________________________________________________________________________
res1_1_branch_2a_bn (BatchNorma (None, 160, 32, 64)  256         res1_1_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 160, 32, 64)  0           res1_1_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res1_1_branch_2b (Conv2D)       (None, 160, 32, 64)  36928       lambda_4[0][0]
__________________________________________________________________________________________________
res1_1_branch_2b_bn (BatchNorma (None, 160, 32, 64)  256         res1_1_branch_2b[0][0]
__________________________________________________________________________________________________
add_2 (Add)                     (None, 160, 32, 64)  0           res1_1_branch_2b_bn[0][0]
                                                                 lambda_3[0][0]
__________________________________________________________________________________________________
lambda_5 (Lambda)               (None, 160, 32, 64)  0           add_2[0][0]
__________________________________________________________________________________________________
res1_2_branch_2a (Conv2D)       (None, 160, 32, 64)  36928       lambda_5[0][0]
__________________________________________________________________________________________________
res1_2_branch_2a_bn (BatchNorma (None, 160, 32, 64)  256         res1_2_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_6 (Lambda)               (None, 160, 32, 64)  0           res1_2_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res1_2_branch_2b (Conv2D)       (None, 160, 32, 64)  36928       lambda_6[0][0]
__________________________________________________________________________________________________
res1_2_branch_2b_bn (BatchNorma (None, 160, 32, 64)  256         res1_2_branch_2b[0][0]
__________________________________________________________________________________________________
add_3 (Add)                     (None, 160, 32, 64)  0           res1_2_branch_2b_bn[0][0]
                                                                 lambda_5[0][0]
__________________________________________________________________________________________________
lambda_7 (Lambda)               (None, 160, 32, 64)  0           add_3[0][0]
__________________________________________________________________________________________________
conv128-s (Conv2D)              (None, 80, 16, 128)  204928      lambda_7[0][0]
__________________________________________________________________________________________________
conv128-s_bn (BatchNormalizatio (None, 80, 16, 128)  512         conv128-s[0][0]
__________________________________________________________________________________________________
lambda_8 (Lambda)               (None, 80, 16, 128)  0           conv128-s_bn[0][0]
__________________________________________________________________________________________________
res2_0_branch_2a (Conv2D)       (None, 80, 16, 128)  147584      lambda_8[0][0]
__________________________________________________________________________________________________
res2_0_branch_2a_bn (BatchNorma (None, 80, 16, 128)  512         res2_0_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_9 (Lambda)               (None, 80, 16, 128)  0           res2_0_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res2_0_branch_2b (Conv2D)       (None, 80, 16, 128)  147584      lambda_9[0][0]
__________________________________________________________________________________________________
res2_0_branch_2b_bn (BatchNorma (None, 80, 16, 128)  512         res2_0_branch_2b[0][0]
__________________________________________________________________________________________________
add_4 (Add)                     (None, 80, 16, 128)  0           res2_0_branch_2b_bn[0][0]
                                                                 lambda_8[0][0]
__________________________________________________________________________________________________
lambda_10 (Lambda)              (None, 80, 16, 128)  0           add_4[0][0]
__________________________________________________________________________________________________
res2_1_branch_2a (Conv2D)       (None, 80, 16, 128)  147584      lambda_10[0][0]
__________________________________________________________________________________________________
res2_1_branch_2a_bn (BatchNorma (None, 80, 16, 128)  512         res2_1_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_11 (Lambda)              (None, 80, 16, 128)  0           res2_1_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res2_1_branch_2b (Conv2D)       (None, 80, 16, 128)  147584      lambda_11[0][0]
__________________________________________________________________________________________________
res2_1_branch_2b_bn (BatchNorma (None, 80, 16, 128)  512         res2_1_branch_2b[0][0]
__________________________________________________________________________________________________
add_5 (Add)                     (None, 80, 16, 128)  0           res2_1_branch_2b_bn[0][0]
                                                                 lambda_10[0][0]
__________________________________________________________________________________________________
lambda_12 (Lambda)              (None, 80, 16, 128)  0           add_5[0][0]
__________________________________________________________________________________________________
res2_2_branch_2a (Conv2D)       (None, 80, 16, 128)  147584      lambda_12[0][0]
__________________________________________________________________________________________________
res2_2_branch_2a_bn (BatchNorma (None, 80, 16, 128)  512         res2_2_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_13 (Lambda)              (None, 80, 16, 128)  0           res2_2_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res2_2_branch_2b (Conv2D)       (None, 80, 16, 128)  147584      lambda_13[0][0]
__________________________________________________________________________________________________
res2_2_branch_2b_bn (BatchNorma (None, 80, 16, 128)  512         res2_2_branch_2b[0][0]
__________________________________________________________________________________________________
add_6 (Add)                     (None, 80, 16, 128)  0           res2_2_branch_2b_bn[0][0]
                                                                 lambda_12[0][0]
__________________________________________________________________________________________________
lambda_14 (Lambda)              (None, 80, 16, 128)  0           add_6[0][0]
__________________________________________________________________________________________________
conv256-s (Conv2D)              (None, 40, 8, 256)   819456      lambda_14[0][0]
__________________________________________________________________________________________________
conv256-s_bn (BatchNormalizatio (None, 40, 8, 256)   1024        conv256-s[0][0]
__________________________________________________________________________________________________
lambda_15 (Lambda)              (None, 40, 8, 256)   0           conv256-s_bn[0][0]
__________________________________________________________________________________________________
res3_0_branch_2a (Conv2D)       (None, 40, 8, 256)   590080      lambda_15[0][0]
__________________________________________________________________________________________________
res3_0_branch_2a_bn (BatchNorma (None, 40, 8, 256)   1024        res3_0_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_16 (Lambda)              (None, 40, 8, 256)   0           res3_0_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res3_0_branch_2b (Conv2D)       (None, 40, 8, 256)   590080      lambda_16[0][0]
__________________________________________________________________________________________________
res3_0_branch_2b_bn (BatchNorma (None, 40, 8, 256)   1024        res3_0_branch_2b[0][0]
__________________________________________________________________________________________________
add_7 (Add)                     (None, 40, 8, 256)   0           res3_0_branch_2b_bn[0][0]
                                                                 lambda_15[0][0]
__________________________________________________________________________________________________
lambda_17 (Lambda)              (None, 40, 8, 256)   0           add_7[0][0]
__________________________________________________________________________________________________
res3_1_branch_2a (Conv2D)       (None, 40, 8, 256)   590080      lambda_17[0][0]
__________________________________________________________________________________________________
res3_1_branch_2a_bn (BatchNorma (None, 40, 8, 256)   1024        res3_1_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_18 (Lambda)              (None, 40, 8, 256)   0           res3_1_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res3_1_branch_2b (Conv2D)       (None, 40, 8, 256)   590080      lambda_18[0][0]
__________________________________________________________________________________________________
res3_1_branch_2b_bn (BatchNorma (None, 40, 8, 256)   1024        res3_1_branch_2b[0][0]
__________________________________________________________________________________________________
add_8 (Add)                     (None, 40, 8, 256)   0           res3_1_branch_2b_bn[0][0]
                                                                 lambda_17[0][0]
__________________________________________________________________________________________________
lambda_19 (Lambda)              (None, 40, 8, 256)   0           add_8[0][0]
__________________________________________________________________________________________________
res3_2_branch_2a (Conv2D)       (None, 40, 8, 256)   590080      lambda_19[0][0]
__________________________________________________________________________________________________
res3_2_branch_2a_bn (BatchNorma (None, 40, 8, 256)   1024        res3_2_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_20 (Lambda)              (None, 40, 8, 256)   0           res3_2_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res3_2_branch_2b (Conv2D)       (None, 40, 8, 256)   590080      lambda_20[0][0]
__________________________________________________________________________________________________
res3_2_branch_2b_bn (BatchNorma (None, 40, 8, 256)   1024        res3_2_branch_2b[0][0]
__________________________________________________________________________________________________
add_9 (Add)                     (None, 40, 8, 256)   0           res3_2_branch_2b_bn[0][0]
                                                                 lambda_19[0][0]
__________________________________________________________________________________________________
lambda_21 (Lambda)              (None, 40, 8, 256)   0           add_9[0][0]
__________________________________________________________________________________________________
conv512-s (Conv2D)              (None, 20, 4, 512)   3277312     lambda_21[0][0]
__________________________________________________________________________________________________
conv512-s_bn (BatchNormalizatio (None, 20, 4, 512)   2048        conv512-s[0][0]
__________________________________________________________________________________________________
lambda_22 (Lambda)              (None, 20, 4, 512)   0           conv512-s_bn[0][0]
__________________________________________________________________________________________________
res4_0_branch_2a (Conv2D)       (None, 20, 4, 512)   2359808     lambda_22[0][0]
__________________________________________________________________________________________________
res4_0_branch_2a_bn (BatchNorma (None, 20, 4, 512)   2048        res4_0_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_23 (Lambda)              (None, 20, 4, 512)   0           res4_0_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res4_0_branch_2b (Conv2D)       (None, 20, 4, 512)   2359808     lambda_23[0][0]
__________________________________________________________________________________________________
res4_0_branch_2b_bn (BatchNorma (None, 20, 4, 512)   2048        res4_0_branch_2b[0][0]
__________________________________________________________________________________________________
add_10 (Add)                    (None, 20, 4, 512)   0           res4_0_branch_2b_bn[0][0]
                                                                 lambda_22[0][0]
__________________________________________________________________________________________________
lambda_24 (Lambda)              (None, 20, 4, 512)   0           add_10[0][0]
__________________________________________________________________________________________________
res4_1_branch_2a (Conv2D)       (None, 20, 4, 512)   2359808     lambda_24[0][0]
__________________________________________________________________________________________________
res4_1_branch_2a_bn (BatchNorma (None, 20, 4, 512)   2048        res4_1_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_25 (Lambda)              (None, 20, 4, 512)   0           res4_1_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res4_1_branch_2b (Conv2D)       (None, 20, 4, 512)   2359808     lambda_25[0][0]
__________________________________________________________________________________________________
res4_1_branch_2b_bn (BatchNorma (None, 20, 4, 512)   2048        res4_1_branch_2b[0][0]
__________________________________________________________________________________________________
add_11 (Add)                    (None, 20, 4, 512)   0           res4_1_branch_2b_bn[0][0]
                                                                 lambda_24[0][0]
__________________________________________________________________________________________________
lambda_26 (Lambda)              (None, 20, 4, 512)   0           add_11[0][0]
__________________________________________________________________________________________________
res4_2_branch_2a (Conv2D)       (None, 20, 4, 512)   2359808     lambda_26[0][0]
__________________________________________________________________________________________________
res4_2_branch_2a_bn (BatchNorma (None, 20, 4, 512)   2048        res4_2_branch_2a[0][0]
__________________________________________________________________________________________________
lambda_27 (Lambda)              (None, 20, 4, 512)   0           res4_2_branch_2a_bn[0][0]
__________________________________________________________________________________________________
res4_2_branch_2b (Conv2D)       (None, 20, 4, 512)   2359808     lambda_27[0][0]
__________________________________________________________________________________________________
res4_2_branch_2b_bn (BatchNorma (None, 20, 4, 512)   2048        res4_2_branch_2b[0][0]
__________________________________________________________________________________________________
add_12 (Add)                    (None, 20, 4, 512)   0           res4_2_branch_2b_bn[0][0]
                                                                 lambda_26[0][0]
__________________________________________________________________________________________________
lambda_28 (Lambda)              (None, 20, 4, 512)   0           add_12[0][0]
__________________________________________________________________________________________________
reshape (Lambda)                (96, None, 2048)     0           lambda_28[0][0]
__________________________________________________________________________________________________
average (Lambda)                (96, 2048)           0           reshape[0][0]
__________________________________________________________________________________________________
affine (Dense)                  (96, 512)            1049088     average[0][0]
__________________________________________________________________________________________________
ln (Lambda)                     (96, 512)            0           affine[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (96, 251)            128763      ln[0][0]
==================================================================================================
Total params: 24,314,491
Trainable params: 24,301,051
Non-trainable params: 13,440
